brew "cmatrix"
brew "direnv"
brew "docker-compose"
brew "figlet"
brew "git"
brew "jq"
brew "openssl@3"
brew "xz"
brew "macvim"
brew "nodebrew"
brew "pyenv"
brew "python@3.12"
brew "shellcheck"
brew "sl"
brew "sqlfluff"
brew "tcl-tk"
brew "tfenv"
brew "tree"
brew "zlib"
cask "docker-desktop"
vscode "adpyke.vscode-sql-formatter"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "corschenzi.mermaid-graphical-editor"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dorzey.vscode-sqlfluff"
vscode "dotjoshjohnson.xml"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "ics.japanese-proofreading"
vscode "jithurjacob.nbpreviewer"
vscode "kintone-extension.kintone-extension"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "sissel.shopify-liquid"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "yoshinorin.current-file-path"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
